automake
curl
emacs27
fd-find
font-manager
gdebi
gdebi-core
gh
git
golang-go
graphviz
htop
hugo
jabref
jq
manpages-dev
mmv
neofetch
pympress
python3-pip
python3-pyqt5
r-base
ripgrep
rofi
rstudio
samba
shellcheck
sqlite3
w3m
wordnet
xclip
yadm
youtube-dl
zathura
zoom