bat
bmon
curl
diatheke
emacs26
fd-find
font-manager
fonts-powerline
gdebi
gdebi-core
gh
git
golang-go
graphviz
htop
hugo
inkscape
jq
manpages-dev
mdp
mmv
neofetch
pdftk
pympress
python3-pip
python3-pyqt5
qalc
qpdfview
r-base
ripgrep
rofi
rstudio
samba
scrot
shellcheck
sqlite3
surfraw
sxhkd
texlive
latexmk
viewnior
w3m
wordnet
xclip
yadm
youtube-dl
zathura
zoom

# dependencies for diff-pdf
automake
g++
libpoppler-glib-dev
libwxgtk3.0-dev
poppler-utils